### Multiple DF

In [2]:
import pandas as pd

In [4]:
orders = pd.read_csv('orders2.csv')

In [5]:
orders.head()

   order_id  customer_id  product_id  quantity   timestamp
0         1            2           3         1  2017-01-01
1         2            2           2         3  2017-01-01
2         3            3           1         1  2017-01-01
3         4            3           2         2  2017-02-01
4         5            3           3         3  2017-02-01

In [6]:
products = pd.read_csv('products.csv')

In [7]:
products.head()

   product_id         description  price
0           1      thing-a-ma-jig      5
1           2  whatcha-ma-call-it     10
2           3          doo-hickey      7
3           4               gizmo      3

In [8]:
customers = pd.read_csv('customers.csv')

In [9]:
customers.head()

   customer_id customer_name        address  phone_number
0            1    John Smith   123 Main St.  212-123-4567
1            2      Jane Doe  456 Park Ave.  949-867-5309
2            3     Joe Schmo   798 Broadway  112-358-1321

In [14]:
### Merge in pandas == Join in SQL   .merge

In [16]:
##Inner Join


new_df = pd.merge(orders, customers)
new_df

,order_id,customer_id,product_id,quantity,timestamp,customer_name,address,phone_number
0,1,2,3,1,2017-01-01,Jane Doe,456 Park Ave.,949-867-5309
1,2,2,2,3,2017-01-01,Jane Doe,456 Park Ave.,949-867-5309
2,3,3,1,1,2017-01-01,Joe Schmo,798 Broadway,112-358-1321
3,4,3,2,2,2017-02-01,Joe Schmo,798 Broadway,112-358-1321
4,5,3,3,3,2017-02-01,Joe Schmo,798 Broadway,112-358-1321
5,6,1,4,2,2017-03-01,John Smith,123 Main St.,212-123-4567
6,7,1,1,1,2017-02-02,John Smith,123 Main St.,212-123-4567
7,8,1,4,1,2017-02-02,John Smith,123 Main St.,212-123-4567

In [17]:
## Exercise

#Dados los siguientes dataframes: , usted necesita analizar las ventas
#Cree un nuevo dataframe llamado sales_vs_targets el cual contiene el inner join entre sales y targets
#La empresa quiere saber los meses en que alcanzaron sus objetivos (targets) de ventas (revenue). Para ello seleccione las filas de sales_vs_targets donde revenue es mayor a target. Guardelo en una variable llamada crushing_it

In [18]:
sales = pd.DataFrame({
  'month': ['January', 'February', 'March', 'April', 'May', 'June'],
  'revenue': [300, 290, 310, 325, 475, 495]
})
targets = pd.DataFrame({
  'month': ['January', 'February', 'March', 'April', 'May', 'June'],
  'target': [310, 270, 300, 350, 475, 500]
})